# coding: utf-8

SPIDER_NAME = "spider:news:news163"
CRAWL_SOURCE = u"网易新闻"
ARTICLE_URL_TEMPLATE = "http://j.news.163.com/hy/doc.s?" \
                       "info=2&type=10&hash=&docid={docid}"
COMMENT_URL_TEMPLATE = "http://comment.news.163.com/api/v1" \
                       "/products/a2869674571f77b5a0867c3d71db5856/" \
                       "threads/{docid}/comments/newList?" \
                       "offset={offset}&limit=30"
DOMAIN = "http://j.news.163.com"
START_URL_PREFIX = "http://j.news.163.com/hy/newshot.s?"
CHANNELS = {
    # "本地": 10,
    "娱乐": 2,
    "体育": 3,
    "科技": 5,
    "搞笑": 8,
    "交友": 14,
    "财经": 4,
    "汽车": 6,
    "女人": 7,
    "手机": 26,
    "游戏": 24,
    "数码": 19,
    "人文": 22,
    "历史": 32,
    "美女": 9,
    "家居": 21,
    "旅游": 17,
    "亲子": 23,
    "美食": 18,
    "养生": 30,
    "减肥": 25,
    "星座": 16,
    "生活": 28,
    "LOFTER": 11,
    "专题": 98,
    "图集": 66,
    "房产": 20,
    "动漫": 29,
    "教育": 31,
}

LOCAL_CHANNEL = 10

CITIES = "中卫,七台河,巫山,红河,三明,崇明,白城,池州,西沙,莆田,忠县,大连,定西," \
         "莱芜,和田,贵阳,钦州,赣州,大足,昭通,郑州,黑河,汉中,衡水,雅安,滨州,阳泉," \
         "通辽,澄迈,深圳,邯郸,台州,潮州,张家界,大港,延吉,九江,保亭,塔城,云浮,汕尾," \
         "商洛,常州,库尔勒,梧州,延庆,运城,奉贤,綦江,石嘴山,襄樊,哈尔滨,新乡,宁波," \
         "西安,天水,怒江,盘锦,阿勒泰,金昌,万盛,汤河口,彭水,武汉,阿里,平凉,林芝,巫溪," \
         "驻马店,固原,石河子,黔阳,河池,金华,齐齐哈尔,广州,苏州,仙桃,济南,沙坪坝," \
         "伊宁,江门,三亚,郴州,内江,长春,都匀,佛山,儋州,舟山,文昌,惠州,哈密,商丘," \
         "益阳,大庆,昆明,洛阳,石柱,佳木斯,清远,铜仁,通化,邵阳,顺义,荆门,本溪," \
         "阿拉善左旗,天津,兴义,玉林,廊坊,白沙,锡林浩特,宜宾,亳州,无锡,铜陵,怀柔," \
         "泰州,抚州,海西,海南,百色,恩施,巴南,杭州,黄南,酒泉,临高,北京,自贡,晋城," \
         "济源,大同,广元,西青,肇庆,抚顺,荆州,宁德,浦东,高雄,五指山,巢湖,怀化,秦皇岛," \
         "沧州,晋江,南通,武都,芜湖,青岛,中山,漳州,平谷,铜梁,开封,泸州,喀什,毕节," \
         "贺州,玉树,菏泽,蚌埠,株洲,阜阳,景德镇,达州,大理,漯河,黄冈,琼海,呼伦贝尔," \
         "宿州,北辰,上海,秀山,鞍山,湛江,永川,永州,静海,房山,斋堂,鹤岗,丽江,朔州," \
         "四平,阿拉尔,鄂尔多斯,海东,六安,伊春,湘潭,庆阳,连云港,梅州,津南,南京,潼南," \
         "张家口,承德,咸阳,合川,榆林,昌平,南昌,天门,咸宁,琼中,克拉玛依,万宁,上饶," \
         "松江,威海,大兴安岭,泉州,南汇,大兴,唐山,遂宁,铁岭,万州龙宝,台中,资阳,武隆," \
         "鹰潭,银川,荣昌,防城港,镇江,延安,济宁,潜江,香格里拉,宜春,临汾,宝坻,梁平," \
         "日照,马鞍山,安顺,宜昌,垫江,锦州,丰都,潍坊,海北,濮阳,淮安,普洱,乐山,阿图什," \
         "山南,渭南,信阳,茂名,赤峰,青浦,南阳,烟台,徐州,南平,甘孜,德宏,昌江,武威,湖州," \
         "吉安,吉林,阳江,北碚,乌鲁木齐,淮北,双鸭山,葫芦岛,蓟县,盐城,南宁,汉沽,合作," \
         "来宾,渝北,许昌,丰台,楚雄,琼山,文山,阿坝,黔江,绵阳,铜川,宝鸡,集宁,广安," \
         "通州,白银,临沂,塘沽,衢州,嘉定,白山,晋中,临河,武清,宣城,临沧,温州,西宁," \
         "衡阳,宿迁,辽源,东方,遵义,阜新,安阳,凉山,北海,沈阳,兰州,汕头,长沙,吐鲁番," \
         "娄底,阿克苏,辽阳,绥化,韶关,龙岩,福州,泰安,河源,淮南,成都,太原,随州,果洛," \
         "忻州,城口,滁州,东营,景洪,拉萨,保定,长治,鸡西,海口,台北县,崇左,包头,绍兴," \
         "聊城,巴中,松原,鹤壁,金山,吉首,厦门,宁河,德阳,新余,乐东,吕梁,淄博,鄂州,营口," \
         "丽水,丹东,嘉峪关,攀枝花,石家庄,珠海,合肥,东莞,枣庄,南川,江津,酉阳,重庆," \
         "宝山,焦作,凯里,博乐,霞云岭,屯昌,牡丹江,乌海,黄石,呼和浩特,三门峡,神农架," \
         "长寿,扬州,南沙岛,桂林,昌都,十堰,张掖,云阳,开县,玉溪,日喀则,常德,临夏,陵水," \
         "邢台,乌兰浩特,德州,平顶山,嘉兴,柳州,眉山,昌吉,定安,东丽,黄山,周口,岳阳," \
         "揭阳,南充,保山,贵港,萍乡,六盘水,安康,涪陵,奉节,孝感,那曲,安庆,吴忠,璧山,曲靖"


